RitsuYi/STM32_Embedded_Journey/03_Tutorial_Labs/STM32F407_Advanced/02-小车实现测试/Hardware/OLED.c
#include "stm32f4xx.h"
#include "OLED.h"
#include "ADC_Bat.h"
#include "Delay.h"
#include "Encoder.h"
#include "MPU6050.h"
#include "Motor.h"
#include "PID.h"
#include <string.h>
#include <math.h>
#include <stdio.h>
#include <stdarg.h>

/**
  * 数据存储格式：
  * 纵向8点，高位在下，先从左到右，再从上到下
  * 每一个Bit对应一个像素点
  * 
  *      B0 B0                  B0 B0
  *      B1 B1                  B1 B1
  *      B2 B2                  B2 B2
  *      B3 B3  ------------->  B3 B3 --
  *      B4 B4                  B4 B4  |
  *      B5 B5                  B5 B5  |
  *      B6 B6                  B6 B6  |
  *      B7 B7                  B7 B7  |
  *                                    |
  *  -----------------------------------
  *  |   
  *  |   B0 B0                  B0 B0
  *  |   B1 B1                  B1 B1
  *  |   B2 B2                  B2 B2
  *  --> B3 B3  ------------->  B3 B3
  *      B4 B4                  B4 B4
  *      B5 B5                  B5 B5
  *      B6 B6                  B6 B6
  *      B7 B7                  B7 B7
  * 
  * 坐标轴定义：
  * 左上角为(0, 0)点
  * 横向向右为X轴，取值范围：0~127
  * 纵向向下为Y轴，取值范围：0~63
  * 
  *       0             X轴           127 
  *      .------------------------------->
  *    0 |
  *      |
  *      |
  *      |
  *  Y轴 |
  *      |
  *      |
  *      |
  *   63 |
  *      v
  * 
  */


/*全局变量*********************/

/**
  * OLED显存数组
  * 所有的显示函数，都只是对此显存数组进行读写
  * 随后调用OLED_Update函数或OLED_UpdateArea函数
  * 才会将显存数组的数据发送到OLED硬件，进行显示
  */
uint8_t OLED_DisplayBuf[8][128];
static volatile uint32_t OLED_I2C_LastErrorFlags = 0;
static volatile uint32_t OLED_I2C_ErrorCount = 0;

static void OLED_I2C_Delay(void)
{
}

static void OLED_GPIO_ClockCmd(GPIO_TypeDef *GPIOx, FunctionalState NewState)
{
	if (GPIOx == GPIOA)
	{
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, NewState);
	}
	else if (GPIOx == GPIOB)
	{
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, NewState);
	}
	else if (GPIOx == GPIOC)
	{
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, NewState);
	}
	else if (GPIOx == GPIOD)
	{
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, NewState);
	}
	else if (GPIOx == GPIOE)
	{
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, NewState);
	}
	else if (GPIOx == GPIOF)
	{
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOF, NewState);
	}
	else if (GPIOx == GPIOG)
	{
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOG, NewState);
	}
	else if (GPIOx == GPIOH)
	{
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOH, NewState);
	}
	else if (GPIOx == GPIOI)
	{
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOI, NewState);
	}
}

static ErrorStatus OLED_I2C_WaitBusyReset(void)
{
	uint32_t Timeout = OLED_I2C_TIMEOUT;
	
	while (I2C_GetFlagStatus(OLED_I2C_INSTANCE, I2C_FLAG_BUSY) == SET)
	{
		if (Timeout-- == 0)
		{
			OLED_I2C_LastErrorFlags = OLED_I2C_ERROR_BUSY_TIMEOUT;
			OLED_I2C_ErrorCount++;
			return ERROR;
		}
	}
	
	return SUCCESS;
}

static uint32_t OLED_I2C_GetErrorFlags(void)
{
	uint32_t Flags = 0;
	
	if (I2C_GetFlagStatus(OLED_I2C_INSTANCE, I2C_FLAG_AF) == SET)
	{
		Flags |= I2C_FLAG_AF;
	}
	if (I2C_GetFlagStatus(OLED_I2C_INSTANCE, I2C_FLAG_BERR) == SET)
	{
		Flags |= I2C_FLAG_BERR;
	}
	if (I2C_GetFlagStatus(OLED_I2C_INSTANCE, I2C_FLAG_ARLO) == SET)
	{
		Flags |= I2C_FLAG_ARLO;
	}
	if (I2C_GetFlagStatus(OLED_I2C_INSTANCE, I2C_FLAG_OVR) == SET)
	{
		Flags |= I2C_FLAG_OVR;
	}
	
	return Flags;
}

static void OLED_I2C_ClearErrorFlags(uint32_t Flags)
{
	if ((Flags & I2C_FLAG_AF) != 0)
	{
		I2C_ClearFlag(OLED_I2C_INSTANCE, I2C_FLAG_AF);
	}
	if ((Flags & I2C_FLAG_BERR) != 0)
	{
		I2C_ClearFlag(OLED_I2C_INSTANCE, I2C_FLAG_BERR);
	}
	if ((Flags & I2C_FLAG_ARLO) != 0)
	{
		I2C_ClearFlag(OLED_I2C_INSTANCE, I2C_FLAG_ARLO);
	}
	if ((Flags & I2C_FLAG_OVR) != 0)
	{
		I2C_ClearFlag(OLED_I2C_INSTANCE, I2C_FLAG_OVR);
	}
}

static void OLED_I2C_RecoverBus(void)
{
	I2C_InitTypeDef I2C_InitStructure;
	
	I2C_Cmd(OLED_I2C_INSTANCE, DISABLE);
	I2C_DeInit(OLED_I2C_INSTANCE);
	
	I2C_InitStructure.I2C_ClockSpeed = OLED_I2C_CLOCK_SPEED;
	I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
	I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
	I2C_InitStructure.I2C_OwnAddress1 = 0x00;
	I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
	I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
	I2C_Init(OLED_I2C_INSTANCE, &I2C_InitStructure);
	I2C_Cmd(OLED_I2C_INSTANCE, ENABLE);
}

static ErrorStatus OLED_I2C_WaitEvent(uint32_t Event)
{
	uint32_t Timeout = OLED_I2C_TIMEOUT;
	
	while (I2C_CheckEvent(OLED_I2C_INSTANCE, Event) != SUCCESS)
	{
		uint32_t ErrorFlags = OLED_I2C_GetErrorFlags();
		
		if (ErrorFlags != 0)
		{
			OLED_I2C_LastErrorFlags = ErrorFlags;
			OLED_I2C_ErrorCount++;
			return ERROR;
		}
		if (Timeout-- == 0)
		{
			OLED_I2C_LastErrorFlags = OLED_I2C_ERROR_TIMEOUT;
			OLED_I2C_ErrorCount++;
			return ERROR;
		}
	}
	
	return SUCCESS;
}

static ErrorStatus OLED_I2C_Write(uint8_t ControlByte, const uint8_t *Data, uint16_t Count)
{
	uint16_t i;
	uint32_t ErrorFlags;
	
	OLED_I2C_LastErrorFlags = 0;
	
	if (OLED_I2C_WaitBusyReset() != SUCCESS)
	{
		OLED_I2C_RecoverBus();
		return ERROR;
	}
	
	I2C_GenerateSTART(OLED_I2C_INSTANCE, ENABLE);
	if (OLED_I2C_WaitEvent(I2C_EVENT_MASTER_MODE_SELECT) != SUCCESS)
	{
		goto stop_transfer;
	}
	
	I2C_Send7bitAddress(OLED_I2C_INSTANCE, OLED_I2C_ADDRESS, I2C_Direction_Transmitter);
	if (OLED_I2C_WaitEvent(I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED) != SUCCESS)
	{
		goto stop_transfer;
	}
	
	I2C_SendData(OLED_I2C_INSTANCE, ControlByte);
	if (OLED_I2C_WaitEvent(I2C_EVENT_MASTER_BYTE_TRANSMITTED) != SUCCESS)
	{
		goto stop_transfer;
	}
	
	for (i = 0; i < Count; i ++)
	{
		I2C_SendData(OLED_I2C_INSTANCE, Data[i]);
		if (OLED_I2C_WaitEvent(I2C_EVENT_MASTER_BYTE_TRANSMITTED) != SUCCESS)
		{
			goto stop_transfer;
		}
	}
	
	I2C_GenerateSTOP(OLED_I2C_INSTANCE, ENABLE);
	return SUCCESS;
	
stop_transfer:
	I2C_GenerateSTOP(OLED_I2C_INSTANCE, ENABLE);
	ErrorFlags = OLED_I2C_GetErrorFlags();
	if (ErrorFlags != 0)
	{
		OLED_I2C_ClearErrorFlags(ErrorFlags);
	}
	OLED_I2C_RecoverBus();
	return ERROR;
}

/*********************全局变量*/

/*引脚配置*********************/

/**
  * 函    数：OLED写SCL高低电平
  * 参    数：要写入SCL的电平值，范围：0/1
  * 返 回 值：无
  * 说    明：当上层函数需要写SCL时，此函数会被调用
  *           用户需要根据参数传入的值，将SCL置为高电平或者低电平
  *           当参数传入0时，置SCL为低电平，当参数传入1时，置SCL为高电平
  */
void OLED_W_SCL(uint8_t BitValue)
{
	/*根据BitValue的值，将SCL置高电平或者低电平*/
	GPIO_WriteBit(OLED_SCL_PORT, OLED_SCL_PIN, (BitAction)BitValue);
	
	/*如果单片机速度过快，可在此添加适量延时，以避免超出I2C通信的最大速度*/
	OLED_I2C_Delay();
}

