RitsuYi/STM32_Embedded_Journey/03_Tutorial_Labs/STM32F407_Advanced/02-小车实现测试/Hardware/OLED.c
uint32_t OLED_GetI2CLastError(void)
{
	return OLED_I2C_LastErrorFlags;
}

uint32_t OLED_GetI2CErrorCount(void)
{
	return OLED_I2C_ErrorCount;
}

void OLED_Task(void)
{
	char lineBuffer[32];
	uint16_t batteryDeciV;
	PID_SpeedConfig_t speedProfile;

	PID_GetSpeedConfig(&speedProfile);
	batteryDeciV = ADC_Bat_GetVoltageDeciV();

	OLED_ClearArea(0, 0, 128, 64);

	sprintf(lineBuffer, "%s CL%u",
			Motor_GetCarStateName(Motor_GetCarState()),
			(unsigned int)Motor_IsClosedLoopEnabled());
	OLED_ShowString(0, 0, lineBuffer, OLED_6X8);

	sprintf(lineBuffer, "SP%.2f %.2f %.2f",
			speedProfile.kp,
			speedProfile.ki,
			speedProfile.kd);
	OLED_ShowString(0, 8, lineBuffer, OLED_6X8);

	sprintf(lineBuffer, "L%.0f O%.0f",
			speedProfile.integralLimit,
			speedProfile.outputLimit);
	OLED_ShowString(0, 16, lineBuffer, OLED_6X8);

	sprintf(lineBuffer, "LF T%4ld A%4ld U%+3d%%",
			(long)Motor_GetTargetSpeedRpm((Motor_Id_t)BOARD_CAR_LEFT_FRONT_MOTOR),
			(long)Motor_GetActualSpeedRpm((Motor_Id_t)BOARD_CAR_LEFT_FRONT_MOTOR),
			Motor_GetOutputPercent((Motor_Id_t)BOARD_CAR_LEFT_FRONT_MOTOR));
	OLED_ShowString(0, 24, lineBuffer, OLED_6X8);

	sprintf(lineBuffer, "RF T%4ld A%4ld U%+3d%%",
			(long)Motor_GetTargetSpeedRpm((Motor_Id_t)BOARD_CAR_RIGHT_FRONT_MOTOR),
			(long)Motor_GetActualSpeedRpm((Motor_Id_t)BOARD_CAR_RIGHT_FRONT_MOTOR),
			Motor_GetOutputPercent((Motor_Id_t)BOARD_CAR_RIGHT_FRONT_MOTOR));
	OLED_ShowString(0, 32, lineBuffer, OLED_6X8);

	sprintf(lineBuffer, "LR T%4ld A%4ld U%+3d%%",
			(long)Motor_GetTargetSpeedRpm((Motor_Id_t)BOARD_CAR_LEFT_REAR_MOTOR),
			(long)Motor_GetActualSpeedRpm((Motor_Id_t)BOARD_CAR_LEFT_REAR_MOTOR),
			Motor_GetOutputPercent((Motor_Id_t)BOARD_CAR_LEFT_REAR_MOTOR));
	OLED_ShowString(0, 40, lineBuffer, OLED_6X8);

	sprintf(lineBuffer, "RR T%4ld A%4ld U%+3d%%",
			(long)Motor_GetTargetSpeedRpm((Motor_Id_t)BOARD_CAR_RIGHT_REAR_MOTOR),
			(long)Motor_GetActualSpeedRpm((Motor_Id_t)BOARD_CAR_RIGHT_REAR_MOTOR),
			Motor_GetOutputPercent((Motor_Id_t)BOARD_CAR_RIGHT_REAR_MOTOR));
	OLED_ShowString(0, 48, lineBuffer, OLED_6X8);

	sprintf(lineBuffer, "BAT%u.%u Y%+03d G%+03d",
			(unsigned int)(batteryDeciV / 10U),
			(unsigned int)(batteryDeciV % 10U),
			(int)MPU6050_GetYawDeg(),
			(int)MPU6050_GetGyroZDps());
	OLED_ShowString(0, 56, lineBuffer, OLED_6X8);

	OLED_UpdateArea(0, 0, 128, 64);
}

/**
  * 函    数：OLED写SDA高低电平
  * 参    数：要写入SDA的电平值，范围：0/1
  * 返 回 值：无
  * 说    明：当上层函数需要写SDA时，此函数会被调用
  *           用户需要根据参数传入的值，将SDA置为高电平或者低电平
  *           当参数传入0时，置SDA为低电平，当参数传入1时，置SDA为高电平
  */
void OLED_W_SDA(uint8_t BitValue)
{
	/*根据BitValue的值，将SDA置高电平或者低电平*/
	GPIO_WriteBit(OLED_SDA_PORT, OLED_SDA_PIN, (BitAction)BitValue);
	
	/*如果单片机速度过快，可在此添加适量延时，以避免超出I2C通信的最大速度*/
	OLED_I2C_Delay();
}

/**
  * 函    数：OLED引脚初始化
  * 参    数：无
  * 返 回 值：无
  * 说    明：当上层函数需要初始化时，此函数会被调用
  *           用户需要将SCL和SDA引脚初始化为开漏模式，并释放引脚
  */
void OLED_GPIO_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	I2C_InitTypeDef I2C_InitStructure;
	
	/* Use a fixed delay so power-on timing survives optimization and MCU changes. */
	Delay_ms(OLED_POWER_ON_DELAY_MS);
	
	/*在初始化前，加入适量延时，待OLED供电稳定*/
	
	/*将SCL和SDA引脚初始化为开漏模式*/
	OLED_GPIO_ClockCmd(OLED_SCL_PORT, ENABLE);
	if (OLED_SDA_PORT != OLED_SCL_PORT)
	{
		OLED_GPIO_ClockCmd(OLED_SDA_PORT, ENABLE);
	}
	RCC_APB1PeriphClockCmd(OLED_I2C_RCC_APB1_PERIPH, ENABLE);
	
	GPIO_PinAFConfig(OLED_SCL_PORT, OLED_SCL_PINSOURCE, OLED_I2C_GPIO_AF);
	GPIO_PinAFConfig(OLED_SDA_PORT, OLED_SDA_PINSOURCE, OLED_I2C_GPIO_AF);
	
 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = OLED_SCL_PIN;
 	GPIO_Init(OLED_SCL_PORT, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = OLED_SDA_PIN;
 	GPIO_Init(OLED_SDA_PORT, &GPIO_InitStructure);
	
	/*释放SCL和SDA*/
	I2C_Cmd(OLED_I2C_INSTANCE, DISABLE);
	I2C_DeInit(OLED_I2C_INSTANCE);
	
	I2C_InitStructure.I2C_ClockSpeed = OLED_I2C_CLOCK_SPEED;
	I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
	I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
	I2C_InitStructure.I2C_OwnAddress1 = 0x00;
	I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
	I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
	I2C_Init(OLED_I2C_INSTANCE, &I2C_InitStructure);
	I2C_Cmd(OLED_I2C_INSTANCE, ENABLE);
}

/*********************引脚配置*/


/*通信协议*********************/

/**
  * 函    数：I2C起始
  * 参    数：无
  * 返 回 值：无
  */
void OLED_I2C_Start(void)
{
	OLED_W_SDA(1);		//释放SDA，确保SDA为高电平
	OLED_W_SCL(1);		//释放SCL，确保SCL为高电平
	OLED_W_SDA(0);		//在SCL高电平期间，拉低SDA，产生起始信号
	OLED_W_SCL(0);		//起始后把SCL也拉低，即为了占用总线，也为了方便总线时序的拼接
}

/**
  * 函    数：I2C终止
  * 参    数：无
  * 返 回 值：无
  */
void OLED_I2C_Stop(void)
{
	OLED_W_SDA(0);		//拉低SDA，确保SDA为低电平
	OLED_W_SCL(1);		//释放SCL，使SCL呈现高电平
	OLED_W_SDA(1);		//在SCL高电平期间，释放SDA，产生终止信号
}

/**
  * 函    数：I2C发送一个字节
  * 参    数：Byte 要发送的一个字节数据，范围：0x00~0xFF
  * 返 回 值：无
  */
void OLED_I2C_SendByte(uint8_t Byte)
{
	uint8_t i;
	
	/*循环8次，主机依次发送数据的每一位*/
	for (i = 0; i < 8; i++)
	{
		/*使用掩码的方式取出Byte的指定一位数据并写入到SDA线*/
		/*两个!的作用是，让所有非零的值变为1*/
		OLED_W_SDA(!!(Byte & (0x80 >> i)));
		OLED_W_SCL(1);	//释放SCL，从机在SCL高电平期间读取SDA
		OLED_W_SCL(0);	//拉低SCL，主机开始发送下一位数据
	}
	
	OLED_W_SCL(1);		//额外的一个时钟，不处理应答信号
	OLED_W_SCL(0);
}

/**
  * 函    数：OLED写命令
  * 参    数：Command 要写入的命令值，范围：0x00~0xFF
  * 返 回 值：无
  */
void OLED_WriteCommand(uint8_t Command)
{
	if (OLED_I2C_Write(0x00, &Command, 1) != SUCCESS)
	{
		return;
	}
	OLED_I2C_Start();				//I2C起始
	OLED_I2C_SendByte(0x78);		//发送OLED的I2C从机地址
	OLED_I2C_SendByte(0x00);		//控制字节，给0x00，表示即将写命令
	OLED_I2C_SendByte(Command);		//写入指定的命令
	OLED_I2C_Stop();				//I2C终止
}

/**
  * 函    数：OLED写数据
  * 参    数：Data 要写入数据的起始地址
  * 参    数：Count 要写入数据的数量
  * 返 回 值：无
  */
void OLED_WriteData(const uint8_t *Data, uint8_t Count)
{
	if (OLED_I2C_Write(0x40, Data, Count) != SUCCESS)
	{
		return;
	}
	return;
}

/*********************通信协议*/


/*硬件配置*********************/

/**
  * 函    数：OLED初始化
  * 参    数：无
  * 返 回 值：无
  * 说    明：使用前，需要调用此初始化函数
  */
void OLED_Init(void)
{
	OLED_I2C_LastErrorFlags = 0;
	OLED_I2C_ErrorCount = 0;
	OLED_GPIO_Init();			//先调用底层的端口初始化
	
	/*写入一系列的命令，对OLED进行初始化配置*/
	OLED_WriteCommand(0xAE);	//设置显示开启/关闭，0xAE关闭，0xAF开启
	
	OLED_WriteCommand(0xD5);	//设置显示时钟分频比/振荡器频率
	OLED_WriteCommand(0x80);	//0x00~0xFF
	
	OLED_WriteCommand(0xA8);	//设置多路复用率
	OLED_WriteCommand(0x3F);	//0x0E~0x3F
	
	OLED_WriteCommand(0xD3);	//设置显示偏移
	OLED_WriteCommand(0x00);	//0x00~0x7F
	
	OLED_WriteCommand(0x40);	//设置显示开始行，0x40~0x7F
	
	OLED_WriteCommand(0xA1);	//设置左右方向，0xA1正常，0xA0左右反置
	
	OLED_WriteCommand(0xC8);	//设置上下方向，0xC8正常，0xC0上下反置

	OLED_WriteCommand(0xDA);	//设置COM引脚硬件配置
	OLED_WriteCommand(0x12);
	
	OLED_WriteCommand(0x81);	//设置对比度
	OLED_WriteCommand(0xCF);	//0x00~0xFF

	OLED_WriteCommand(0xD9);	//设置预充电周期
	OLED_WriteCommand(0xF1);

	OLED_WriteCommand(0xDB);	//设置VCOMH取消选择级别
	OLED_WriteCommand(0x30);

	OLED_WriteCommand(0xA4);	//设置整个显示打开/关闭

